<script setup lang="ts">
  import type {TabsFormProps} from "~/components/cs/tabs-form/TabsForm";

  const colorMode = useColorMode()
  onMounted(()=> {
    colorMode.preference = 'light'
  })

  const data = <TabsFormProps>{
    tabsFormContent: [
      {
        title: "Заголовок таба 1",
        subTitle: "Равным образом, высококачественный прототип будущего проекта способствует повышению качества анализа существующих паттернов ",
        tabContent: {
          tabContentTitle: "Контент таба 1",
          tabContentText: `
        <p>Безусловно, начало повседневной работы по формированию позиции способствует подготовке и реализации модели развития.</p>
        <ul>
          <li>Элемент ненумерованного списка</li>
          <li>Элемент ненумерованного списка</li>
        </ul>
        <p>Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности выявляет срочную потребность приоретизации разума над эмоциями.</p>
        <ol>
          <li>Элемент нумерованного списка</li>
          <li>Элемент нумерованного списка</li>
        </ol>
        <p>Каждый из нас понимает очевидную вещь: выбранный нами инновационный путь в значительной степени обусловливает важность.</p>

      `
        }
      },
      {
        title: "Заголовок таба 2",
        subTitle: "Равным образом, высококачественный прототип будущего проекта способствует повышению качества анализа существующих паттернов ",
        tabContent: {
          tabContentTitle: "Контент таба 2", // Тут опасно инпуты делать, есть велик шанс нарваться на xss :(
          tabContentText: `
  <div class="form-group">
    <input type="text" id="name" placeholder=" " required>
    <label for="name">Имя</label>
  </div>
    <div class="form-group">
    <input type="text" id="name" placeholder=" " required>
    <label for="name">Имя</label>
  </div>
    <div class="form-group">
    <input type="text" id="name" placeholder=" " required>
    <label for="name">Имя</label>
  </div>
      `
        }
      },
      {
        title: "Заголовок таба 3",
        subTitle: "Равным образом, высококачественный прототип будущего проекта способствует повышению качества анализа существующих паттернов ",
        tabContent: {
          tabContentTitle: "Контент таба 3",
          tabContentText: `
        <p>Безусловно, начало повседневной работы по формированию позиции способствует подготовке и реализации модели развития.</p>
        <ul>
          <li>Элемент ненумерованного списка</li>
          <li>Элемент ненумерованного списка</li>
        </ul>
        <p>Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности выявляет срочную потребность приоретизации разума над эмоциями.</p>
        <ol>
          <li>Элемент нумерованного списка</li>
          <li>Элемент нумерованного списка</li>
        </ol>
        <p>Каждый из нас понимает очевидную вещь: выбранный нами инновационный путь в значительной степени обусловливает важность.</p>
      `
        }
      }
    ]
  }
</script>

<template>
  <lazy-cs-tabs-form class="" :tabs-form-content="data.tabsFormContent" ></lazy-cs-tabs-form>
</template>

<style scoped>
</style>