<script setup lang="ts">
  import type {TabsFormProps} from "~/components/cs/tabs-form/TabsForm";

  const colorMode = useColorMode()
  onMounted(()=> {
    colorMode.preference = 'light'
  })

  const data = <TabsFormProps>{
    tabsFormContent: [
      {
        title: "Заголовок таба 1",
        subTitle: "Равным образом, высококачественный прототип будущего проекта способствует повышению качества анализа существующих паттернов ",
        tabContent: {
          tabContentTitle: "Контент таба 1",
          tabContentText: "Безусловно, начало повседневной работы по формированию позиции способствует подготовке и реализации модели развития. \n" +
              "\n" +
              "Элемент ненумерованного списка\n" +
              "Элемент ненумерованного списка\n" +
              "\n" +
              "Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности выявляет срочную потребность приоретизации разума над эмоциями. \n" +
              "\n" +
              "Элемент нумерованного списка\n" +
              "Элемент нумерованного списка\n" +
              "\n" +
              "Каждый из нас понимает очевидную вещь: выбранный нами инновационный путь в значительной степени обусловливает важность "
        }
      },
      {
        title: "Заголовок таба 2",
        subTitle: "Равным образом, высококачественный прототип будущего проекта способствует повышению качества анализа существующих паттернов ",
        tabContent: {
          tabContentTitle: "Контент таба 2",
          tabContentText: "Безусловно, начало повседневной работы по формированию позиции способствует подготовке и реализации модели развития. \n" +
              "\n" +
              "Элемент ненумерованного списка\n" +
              "Элемент ненумерованного списка\n" +
              "\n" +
              "Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности выявляет срочную потребность приоретизации разума над эмоциями. \n" +
              "\n" +
              "Элемент нумерованного списка\n" +
              "Элемент нумерованного списка\n" +
              "\n" +
              "Каждый из нас понимает очевидную вещь: выбранный нами инновационный путь в значительной степени обусловливает важность "
        }
      },
      {
        title: "Заголовок таба 3",
        subTitle: "Равным образом, высококачественный прототип будущего проекта способствует повышению качества анализа существующих паттернов ",
        tabContent: {
          tabContentTitle: "Контент таба 3",
          tabContentText: "Безусловно, начало повседневной работы по формированию позиции способствует подготовке и реализации модели развития. \n" +
              "\n" +
              "Элемент ненумерованного списка\n" +
              "Элемент ненумерованного списка\n" +
              "\n" +
              "Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности выявляет срочную потребность приоретизации разума над эмоциями. \n" +
              "\n" +
              "Элемент нумерованного списка\n" +
              "Элемент нумерованного списка\n" +
              "\n" +
              "Каждый из нас понимает очевидную вещь: выбранный нами инновационный путь в значительной степени обусловливает важность "
        }
      }
    ]
  }
</script>

<template>
  <cs-tabs-form :tabs-form-content="data.tabsFormContent" ></cs-tabs-form>
</template>

<style scoped>

</style>